{
  "architectures": [
    "T5WithLMHeadModel"
  ],
  "d_ff": 256,
  "d_kv": 64,
  "d_model": 128,
  "decoder_start_token_id": 6,
  "dropout_rate": 0.1,
  "eos_token_id": 7,
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_positions": 512,
  "num_heads": 2,
  "num_layers": 2,
  "output_past": true,
  "pad_token_id": 6,
  "relative_attention_num_buckets": 32,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 2.0,
      "max_length": 200,
      "min_length": 30,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "summarize: "
    }
  },
  "vocab_size": 15,
  "trg_vocab_size": 8
}